Glass.Data/Web References/wsPMSRecepcaoEvento/RecepcaoEvento.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="RecepcaoEvento" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/producao/services2/RecepcaoEvento?xsd=1" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento" />
    </xsd:schema>
  </types>
  <message name="nfeRecepcaoEvento">
    <part name="nfeDadosMsg" element="tns:nfeDadosMsg" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <message name="nfeRecepcaoEventoResponse">
    <part name="nfeRecepcaoEventoResult" element="tns:nfeRecepcaoEventoResult" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <portType name="RecepcaoEventoSoap">
    <operation name="nfeRecepcaoEvento" parameterOrder="nfeDadosMsg nfeCabecMsg">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento/nfeRecepcaoEvento" message="tns:nfeRecepcaoEvento" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento/RecepcaoEventoSoap/nfeRecepcaoEventoResponse" message="tns:nfeRecepcaoEventoResponse" />
    </operation>
  </portType>
  <binding name="recepcaoEventoSoap12Binding" type="tns:RecepcaoEventoSoap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="nfeRecepcaoEvento">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento/nfeRecepcaoEvento" />
      <input>
        <soap12:body use="literal" parts="nfeDadosMsg" />
        <soap12:header message="tns:nfeRecepcaoEvento" part="nfeCabecMsg" use="literal" />
      </input>
      <output>
        <soap12:body use="literal" parts="nfeRecepcaoEventoResult" />
        <soap12:header message="tns:nfeRecepcaoEventoResponse" part="nfeCabecMsg" use="literal" />
      </output>
    </operation>
  </binding>
  <service name="RecepcaoEvento">
    <port name="recepcaoEventoSoap12" binding="tns:recepcaoEventoSoap12Binding">
      <soap12:address location="https://nfe.fazenda.ms.gov.br:443/producao/services2/RecepcaoEvento" />
    </port>
  </service>
</definitions>