demonstracoes/delphi/Win32/Debug/Templates/vm50b/CE/pedido_consultarecibo.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:rec="http://www.portalfiscal.inf.br/nfe/wsdl/RecepcaoEvento"><soap:Header><rec:nfeCabecMsg><rec:versaoDados>3.10</rec:versaoDados><rec:cUF>%s</rec:cUF></rec:nfeCabecMsg></soap:Header><soap:Body><rec:nfeDadosMsg>%s</rec:nfeDadosMsg></soap:Body></soap:Envelope>